# In[]:
# -*- coding: utf-8 -*-
import io
import json
import smtplib
import pymongo
from pymongo import MongoClient
from TwitterAPI import TwitterAPI
import datetime as dt
import requests
from urllib3.exceptions import ProtocolError
import DataCleansing
import time

# In[]:
client = MongoClient('mongodb://localhost:27017/University')
db = client.University

# In[]:
ckey = "pVF6tCKF2bf3d4lemROl4Kvig"
csecret = "WmsmPETOJiq1TMEHeVN3O1mJHAsoOH7bSzlYYA8d1Yg0XKazdy"
atoken = "1174571429590777858-yoJ2Om0wGBFXw2grrwPQKWoGy5AMWa"
asecret = "Gr2zP2tM29iJ91VoVw5PBP9zNNcbG3tYQO0cNIZfGRfYr"
api = TwitterAPI(ckey, csecret, atoken, asecret)

ckey2 = "faSFs3dbCg4ESmwvdtKDB5vXB"
csecret2 = "rypAJfsmTwHX4ppQpdgMOgDMMNcGTjijCsrh9G2hA3CAttuHF7"
atoken2 = "1174555805883912192-FXbUlJFYCWNBhw25HsaYpJR7XscZHk"
asecret2 = "cj7j9AXfFFGnU34hQa9qtiYweu6K2A3hINjPCKHHCNGFs"
api2 = TwitterAPI(ckey2,csecret2,atoken2,asecret2)

allAPI = [api,api2]


# In[]:
with io.open("keywordFilter.json", encoding="utf-8") as json_file:
    twData = json.load(json_file)
    
# In[]:
# TRACK_TERM = "มหิดล", "ลูกพระบิดา", "#ทีมMU", "#มหิดล", "#ทีมมหิดล", "#มหาวิทยาลัยมหิดล", "ม.มหิดล", "#Mahidol", "#WeMahidol", "#โควตามหิดล",    "จุฬา", "มหาลัยสีชมพู", "มหาลัยแถวสามย่าน", "เด็กสามย่าน", "ลูกพระเกี้ยว", "ลูกจามจุรี", "ทีมCU", "ทีมฬ", "#จุฬา", "#มหาลัยสีชมพู", "#เด็กสามย่าน", "#ลูกพระเกี้ยว", "#ลูกจามจุรี", "#ทีมCU", "#ทีมcu", "#ทีมฬ", "#ทีมจุฬา", "#cutep", "ม.จุฬา",            "ลูกพระพิรุณ", "มเกษตร", "เกษตรศาสตร์", "#ทีมมก", "#ทีมku", "เกษตรบางเขน", "#ลูกพระพิรุณ", "#มเกษตร", "#เกษตรศาสตร์", "#มก", "#ทีมเกษตร", "#เกษตรบางเขน", "#เกษตรกำแพงแสน", "#ทีมเกษตรศาสตร์", "#Kasetsart", "#ทีมเกษตรกําแพงแสน", "ม.เกษตร", "#มหาวิทยาลัยเกษตรศาสตร์",            "#มช", "มเชียงใหม่", "#ทีมมช", "ทีมCMU", "#มเชียงใหม่", "ม.เชียงใหม่", "#ทีมCMU", "#มหาวิทยาลัยเชียงใหม่", "#มข", "ลูกเจ้าพ่อมอดินแดง", "มขอนแก่น", "#ทีมมข", "ทีมKKU", "#ทีมKKU", "#ลูกเจ้าพ่อมอดินแดง", "#มขอนแก่น", "ม.ขอนแก่น", "#มหาวิทยาลัยขอนแก่น", "มหาวิทยาลัยขอนแก่น",            "มจธ", "#ทีมบางมด", "#KMUTT", "#มจธ", "#บางมด", "มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี", "#มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี", "#ทีมKMUTT", "ช่อศรีตรัง", "มสงขลา", "#ทีมมอ", "ทีมPSU", "#มสงขลา", "#ทีมPSU", "สงขลานครินคร์", "มหาวิทยาลัยสงขลานครินคร์", "#สงขลานครินคร์", "#มหาวิทยาลัยสงขลานครินคร์", "#ทีมสงขลานครินคร์",            "ธรรมศาสตร์", "ลูกแม่โดม", "พ่อปรีดี", "ศิษย์อาจารย์ป๋วย", "#มธ", "#ทีมมธ", "#ทีมTU", "#ทีมTu", "#ทีมtu", "#ธรรมศาสตร์", "#ลูกแม่โดม", "#พ่อปรีดี", "#ศิษย์อาจารย์ป๋วย", "#มหาวิทยาลัยธรรมศาสตร์", "ม.ธรรมศาสตร์",            "มทส", "ลูกแสดทอง", "#ทีมสุรนารี", "มสุรนารี", "ทีมSUT", "#มทส", "#มสุรนารี", "#ทีมSUT", "#มหาวิทยาลัยสุรนารี", "มหาวิทยาลัยเทคโนโลยีสุรนารี", "#มหาวิทยาลัยเทคโนโลยีสุรนารี", "ลูกพระนเรศ", "มนเรศวร", "#เด็กมอนอ", "#ทีมมน", "#ทีมนเรศวร", "#มอนอ", "ทีมNU", "#ทีมNU", "#มหาวิทยาลัยนเรศวร", "ม.นเรศวร",            "ทีมลาดกระบัง", "#kmitl", "พระจอมเกล้าเจ้าคุณทหารลาดกระบัง", "#สจล", "#ทีมสจล", "#ทีมลาดกระบัง", "#ทีมkmitl", "#พระจอมเกล้าเจ้าคุณทหารลาดกระบัง", "มศว", "ทีมSWU", "มหาวิทยาลัยศรีนครินทรวิโรฒ", "#มศว", "#ทีมSWU", "#มหาวิทยาลัยศรีนครินทรวิโรฒ", "#ทีมมศว",            "มมส", "ทีมMSU", "#มมส", "#ทีมMSU", "#มหาวิทยาลัยมหาสารคาม", "มศก", "#ทีมSU", "ศิลปากร", "ม.ศิลปกร", "#มศก", "มหาวิทยาลัยศิลปกร", "#ศิลปากร", "#ทีมมศก", "#ทีมศิลปากร", "#มหาวิทยาลัยศิลปกร", "มบูร", "ทีมบูรพา", "ทีมBUU", "#มบูร", "#ทีมบูรพา", "#ทีมBUU", "#มหาวิทยาลัยบูรพา", "มอบู", "#มอบู",            "มฟล", "เด็กดอยแง่ม", "มแม่ฟ้าหลวง", "ทีมMFU", "#มฟล", "#มแม่ฟ้าหลวง", "#ทีมMFU", "#ทีมมฟล", "#ทีมแม่ฟ้าหลวง", "#แม่ฟ้าหลวง", "ม.แม่ฟ้าหลวง", "ทีมพระนครเหนือ", "มจพ", "ทีมkmutnb", "#ทีมพระนครเหนือ", "#มจพ", "#ทีมkmutnb", "#kmutnb", "ทีมมจ", "ทีมแม่โจ้", "มแม่โจ้", "ทีมMJU", "มหาวิทยาลัยแม่โจ้", "#ทีมมจ", "#ทีมแม่โจ้", "#มแม่โจ้", "#ทีมMJU", "#มหาวิทยาลัยแม่โจ้", "ม.แม่โจ้",            "วลัยลักษณ์", "ทีมมวล", "ทีมWU", "#วลัยลักษณ์", "#ทีมมวล", "#ทีมWU", "#ทีมวลัยลักษณ์", "#มหาวิทยาลัยวลัยลักษณ์", "สวนสุนันทา", "มรสส", "สวนนัน", "ทีมSSRU", "#สวนสุนันทา", "#มรสส", "#สวนนัน", "#ทีมSSRU", "#ทีมสวนสุนันทา", "#ทีมมรสส", "#ทีมสวนนัน", "สถาบันเทคโนโลยีแห่งเอเชีย", "ทีมAIT", "#สถาบันเทคโนโลยีแห่งเอเชีย", "#ทีมAIT",            "#มอรังสิต", "#มรส", "มรังสิต", "#ทีมรังสิต", "#ทีมRSU", "#ทีมรังสิต", "ม.รังสิต", "เทคโนมหานคร", "เทคโนโลยีมหานคร", "#เทคโนมหานคร", "#เทคโนโลยีมหานคร", "#ทีมเทคโนมหานคร", "#ทีมmut", "#มกท", "มกรุงเทพ", "ทีมBU", "#บียู", "#ทีมบียู", "#ทีมBU", "#มหาวิทยาลัยกรุงเทพ", "ม.กรุงเทพ",            "เอแบค", "อัสสัมชัญ", "ทีมabac", "#เอแบค", "#อัสสัมชัญ", "#ทีมabac", "#ทีมเอแบค", "ลูกแม่ไทร", "#ทีมUTCC", "เด็กหัวการค้า", "ทีมหอการค้า", "#เด็กหัวการค้า", "#ทีมหอการค้า", "#มหาวิทยาลัยหอการค้า", "#มหาวิทยาลัยหอการค้าไทย", "ม.หอการค้า", "ม.หอการค้าไทย", "ทีมมพย", "ทีมพายัพ", "มพายัพ", "#ทีมมพย", "#ทีมพายัพ", "#มพายัพ", "ม.พายัพ", "#มหาวิทยาลัยพายัพ",            "มฉก", "หัวเฉียว", "ทีมHCU", "#มฉก", "#หัวเฉียว", "#ทีมHCU", "#มหาวิทยาลัยหัวเฉียว", "ม.หัวเฉียวเฉลิมพระเกียรติ", "มสยาม", "ทีมมสยาม", "#มสยาม", "#ทีมมสยาม", "ธุรกิจบัณฑิตย์", "ทีมมธบ", "ทีมDPU", "#ธุรกิจบัณฑิตย์", "#ทีมมธบ", "#ทีมDPU", "วงษ์ชวลิตกุล", "วงชวลิตกุล", "ทีมมว", "ทีมVU", "#วงษ์ชวลิตกุล", "#วงชวลิตกุล", "#ทีมมว", "#ทีมVU",            "มราชธานี", "#มราชธานี", "#ทีมRTU", "มชินวัตร", "#มชินวัตร", "#ทีมSIU", "เกษมบัณฑิต", "ทีมเกษม", "มเกษม", "#เกษมบัณฑิต", "#ทีมเกษม", "#มเกษม", "#มหาวิทยาลัยเกษมบัณฑิต", "ฟาฏอนี", "#ฟาฏอนี", "ทีมspu", "ทีมศรีปทุม", "มศรีปทุม", "#DekSPU", "#SripatumUniversity", "#ทีมspu", "#ทีมศรีปทุม", "#มศรีปทุม",            "มเกริก", "ทีมKRU", "#มเกริก", "#ทีมKRU", "#ทีมเกริก", "เอเชียอาคเนย์", "ทีมSAU", "#เอเชียอาคเนย์", "#ทีมSAU", "#มหาวิทยาลัยเอเชียอาคเนย์", "วิทยาลัยเซนต์หลุยส์", "#วิทยาลัยเซนต์หลุยส์", "มหาวิทยาลัยเซนต์จอห์น", "มเซนต์จอห์น", "#มหาวิทยาลัยเซนต์จอห์น"
TRACK_TERM = "มหิดล","ลูกพระบิดา","#ทีมMU","#มหิดล","#ทีมมหิดล","#มหาวิทยาลัยมหิดล","ม.มหิดล","#Mahidol","#WeMahidol","#โควตามหิดล", "จุฬา","มหาลัยสีชมพู","มหาลัยแถวสามย่าน","เด็กสามย่าน","ลูกพระเกี้ยว","ลูกจามจุรี","ทีมCU","ทีมฬ","#จุฬา","#มหาลัยสีชมพู","#เด็กสามย่าน","#ลูกพระเกี้ยว","#ลูกจามจุรี","#ทีมCU","#ทีมcu","#ทีมฬ","#ทีมจุฬา","#cutep","ม.จุฬา", "ลูกพระพิรุณ","มเกษตร","เกษตรศาสตร์","#ทีมมก","#ทีมku","เกษตรบางเขน","#ลูกพระพิรุณ","#มเกษตร","#เกษตรศาสตร์","#มก","#ทีมเกษตร","#เกษตรบางเขน","#เกษตรกำแพงแสน","#ทีมเกษตรศาสตร์","#Kasetsart","#ทีมเกษตรกําแพงแสน","ม.เกษตร","#มหาวิทยาลัยเกษตรศาสตร์" ,"#มช","มเชียงใหม่","#ทีมมช","ทีมCMU","#มเชียงใหม่","ม.เชียงใหม่","#ทีมCMU","#มหาวิทยาลัยเชียงใหม่","#มข","ลูกเจ้าพ่อมอดินแดง","มขอนแก่น","#ทีมมข","ทีมKKU","#ทีมKKU","#ลูกเจ้าพ่อมอดินแดง","#มขอนแก่น","ม.ขอนแก่น","#มหาวิทยาลัยขอนแก่น","มหาวิทยาลัยขอนแก่น","ธรรมศาสตร์","ลูกแม่โดม","พ่อปรีดี","ศิษย์อาจารย์ป๋วย","#มธ","#ทีมมธ","#ทีมTU","#ทีมTu","#ทีมtu","#ธรรมศาสตร์","#ลูกแม่โดม","#พ่อปรีดี","#ศิษย์อาจารย์ป๋วย","#มหาวิทยาลัยธรรมศาสตร์","ม.ธรรมศาสตร์","มศว","ทีมSWU","มหาวิทยาลัยศรีนครินทรวิโรฒ","#มศว","#ทีมSWU","#มหาวิทยาลัยศรีนครินทรวิโรฒ","#ทีมมศว","มมส","ทีมMSU","#มมส","#ทีมMSU","#มหาวิทยาลัยมหาสารคาม","มบูร","ทีมบูรพา","ทีมBUU","#มบูร","#ทีมบูรพา","#ทีมBUU","#มหาวิทยาลัยบูรพา","มอบู","#มอบู","มฟล","เด็กดอยแง่ม","มแม่ฟ้าหลวง","ทีมMFU","#มฟล","#มแม่ฟ้าหลวง","#ทีมMFU","#ทีมมฟล","#ทีมแม่ฟ้าหลวง","#แม่ฟ้าหลวง","ม.แม่ฟ้าหลวง"


# In[]:
def getRawTwitter():
    for i in range(2):
        try:
            print('API ',i+1)
            r = allAPI[i].request('statuses/filter', {'track': TRACK_TERM,'extended_tweet':'full_text'})
            for item in r:
                tweet = item['text']
                university = 'empty'
                keyword = 'empty'
                rt = "",tweet[0],tweet[1]
                if not("R" == rt[1] and "T" == rt[2]):
                        if "extended_tweet" in item:
                            for key, value in twData.items():
                                for kw in value:
                                    if kw.lower() in item['extended_tweet']['full_text']:
                                        university = key
                                        keyword = kw
                            if university != 'empty':
                                db.tweetFilter_raw_data.insert_one(
                                        {
                                            'university':university,
                                            'keyword':keyword,
                                            'id_str': item['id_str'],
                                            'data':item,
                                            'timeUpdate':dt.datetime.today(),
                                            'addData':'incomplete'
                                        })
                                print(university ,' add Extend Tweet')
                        else:
                            for key, value in twData.items():
                                for kw in value:
                                    if kw.lower() in item['text']:
                                        university = key
                                        keyword = kw
                            if university != 'empty':
                                db.tweetFilter_raw_data.insert_one(
                                        {
                                            'university':university,
                                            'keyword':keyword,
                                            'id_str': item['id_str'],
                                            'data':item,
                                            'timeUpdate':dt.datetime.today(),
                                            'addData':'incomplete'
                                        })
                                print(university ,' add Tweet')
                        DataCleansing.tweetFilterCleansing()
                else:
                        if "extended_tweet" in item['retweeted_status']:
                            for key, value in twData.items():
                                for kw in value:
                                    if kw.lower() in item['retweeted_status']['extended_tweet']['full_text']:
                                        university = key
                                        keyword = kw
                            if university != 'empty':
                                db.retweet_raw_data.insert_one(
                                        {
                                            'university':university,
                                            'keyword':keyword,
                                            'id_str': item['id_str'],
                                            'data':item,
                                            'timeUpdate':dt.datetime.today(),
                                            'addData':'incomplete'
                                        })
                                print(university ,' add Reweet')
                        else:
                            for key, value in twData.items():
                                for kw in value:
                                    if kw.lower() in item['retweeted_status']['text']:
                                        university = key
                                        keyword = kw
                            if university != 'empty':
                                db.retweet_raw_data.insert_one(
                                        {
                                            'university':university,
                                            'keyword':keyword,
                                            'id_str': item['id_str'],
                                            'data':item,
                                            'timeUpdate':dt.datetime.today(),
                                            'addData':'incomplete'
                                        })
                                print(university ,' add Reweet')
                        DataCleansing.retweetFilterCleansing()
        except:
            next     


# In[ ]:
if __name__ == '__main__':
    while True: 
        try:
            getRawTwitter()
        except:
            time.sleep(30)